<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"98fa616d49897daae5a1bfddf22e5ede98b1a47ceae55ff08e90545c9a372597","plan_job_ref":"Job Staging Image Build & Push #32 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7329991379","plan_hash":"b4fb60dabe05424e596d8fbb062a0756a4dd23499fcffb3aad287cef4c6dd0af","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = "arn:aws:ecs:eu-central-1:806066816337:cluster/dev-fastapi-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = "aws_ecs_task_definition.task_definition_1.arn"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = [
+               "sg-0ac5d9e923d0871aa",
            ]
+           subnets          = (sensitive value)
        }
    }

  # aws_ecs_task_definition.task_definition_1 must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition_1" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container-image:1" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container-image" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
-                   mountPoints  = []
                    name         = "dev_FastAPI_definition"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (4 unchanged attributes hidden)
                },
            ]
        )
!~      family                   = "dev-fastapi-container-image" -> "dev-fastapi-container" # forces replacement
!~      id                       = "***************************" -> (known after apply)
!~      revision                 = 1 -> (known after apply)
-       tags                     = {} -> null
!~      tags_all                 = {} -> (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #32](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7329991379)